{
  "nav": {
    "home": "ទំព័រដើម",
    "about": "អំពីខ្ញុំ",
    "work": "បទពិសោធន៍ការងារ",
    "projects": "គម្រោង",
    "contact": "ទំនាក់ទំនង"
  },
  "home": {
    "greeting": "សួស្តី ខ្ញុំឈ្មោះ",
    "title": "អ្នកអភិវឌ្ឍន៍ Frontend",
    "description": "ខ្ញុំជាអ្នកអភិវឌ្ឍន៍កម្មវិធីដែលមានបទពិសោធន៍ ២ ឆ្នាំជា Frontend Developer និង ១ ឆ្នាំជា Backend Developer។ ខ្ញុំចូលចិត្តបង្កើតចំណុចប្រទាក់ទំនើបដែលងាយស្រួលប្រើ និងបង្កើតប្រព័ន្ធ backend ដែលអាចជឿទុកចិត្តបាន។ ខ្ញុំតែងតែចង់រៀនបច្ចេកវិទ្យាថ្មីៗ និងធ្វើអោយប្រសើរឡើងនូវជំនាញរបស់ខ្ញុំតាមរយៈគម្រោងពិតប្រាកដ។",
    "contactBtn": "ទំនាក់ទំនងខ្ញុំ"
  },
  "about": {
    "title": "អំពីខ្ញុំ",
    "description": "ខ្ញុំជាអ្នកអភិវឌ្ឍន៍គេហទំព័រ Frontend ដែលមានបទពិសោធន៍ខ្លាំងក្នុង frameworks ទំនើបដូចជា React, Next.js, Vue និង Nuxt ផ្តោតលើការបង្កើតចំណុចប្រទាក់ដែលឆ្លើយតប មានមាត្រដ្ឋាន និងងាយស្រួលប្រើ។ ខ្ញុំមានចំណេះដឹងក្នុងការអភិវឌ្ឍន៍ backend ជាពិសេសជាមួយ NestJS ដែលអនុញ្ញាតឱ្យខ្ញុំសហការប្រកបដោយប្រសិទ្ធភាពនៅទូទាំង stack និងបង្កើតដំណោះស្រាយ frontend ដែលរួមបញ្ចូលគ្នាបានល្អ។ ខ្ញុំមានជំនាញក្នុងការអភិវឌ្ឍន៍ UI និងប្រព័ន្ធរចនាដោយប្រើ Tailwind CSS, Ant Design និង shadcn/ui ហើយខ្ញុំមានភាពងាយស្រួលក្នុងការធ្វើការជាមួយ PostgreSQL, Docker, Git និង Figma ដើម្បីផ្តល់នូវកម្មវិធីស្អាត និងត្រៀមរួចរាល់សម្រាប់ផលិតកម្ម។"
  },
  "workExperience": {
    "title": "បទពិសោធន៍ការងារ",
    "jobs": [
      {
        "title": "អ្នកអភិវឌ្ឍន៍ Frontend",
        "company": "White Sand Casino",
        "date": "វិច្ឆិកា ២០២៤ - បច្ចុប្បន្ន",
        "description": "បានអភិវឌ្ឍន៍ និងថែរក្សាទំព័រគ្រប់គ្រង ក៏ដូចជាគេហទំព័រផ្លូវការទាំងមូល ដោយត្រួតពិនិត្យគ្រប់ទិដ្ឋភាពនៃការរចនា មុខងារ និងដំណើរការ។ ធានានូវបទពិសោធន៍អ្នកប្រើប្រាស់រលូន បង្កើនប្រសិទ្ធភាពកូដសម្រាប់មាត្រដ្ឋាន និងការថែទាំ អនុវត្តការអនុវត្តល្អបំផុតសម្រាប់សុវត្ថិភាព និងសហការជាមួយអ្នកពាក់ព័ន្ធដើម្បីបំពេញតម្រូវការអាជីវកម្ម និងធ្វើអោយវេទិកាប្រសើរឡើងជាបន្តបន្ទាប់។"
      },
      {
        "title": "អ្នកអភិវឌ្ឍន៍ Full-Stack",
        "company": "Sala Tech",
        "date": "សីហា ២០២៤ - វិច្ឆិកា ២០២៤",
        "description": "បានធ្វើការលើការអភិវឌ្ឍន៍ទាំង frontend និង backend ដើម្បីបង្កើតវិបផតថលសិស្ស និងមុខងារគ្រប់គ្រងដោយប្រើបច្ចេកវិទ្យាចុងក្រោយបំផុត ធានានូវមាត្រដ្ឋាន ដំណើរការ និងបទពិសោធន៍អ្នកប្រើប្រាស់រលូន។ លើសពីនេះ បានដឹកនាំ និងណែនាំសិក្ខាកាមក្នុងការអភិវឌ្ឍន៍គម្រោងឧបករណ៍ឥតគិតថ្លៃក្រោម Sala Tech ដោយណែនាំពួកគេតាមរយៈការរចនាប្រព័ន្ធ ការអនុវត្ត និងការអនុវត្តអភិវឌ្ឍន៍ល្អបំផុតដើម្បីផ្តល់គម្រោងដោយជោគជ័យ។"
      },
      {
        "title": "អ្នកអភិវឌ្ឍន៍ Frontend",
        "company": "TSD - Technology Solution Development",
        "date": "មិថុនា ២០២៤ - កក្កដា ២០២៤",
        "description": "បានអភិវឌ្ឍន៍កម្មវិធីគេហទំព័រទំព័រតែមួយទំនើបសម្រាប់ TSD ដោយប្រើបច្ចេកវិទ្យា frontend ទំនើប ផ្តល់នូវដំណោះស្រាយម៉ឺនុយឌីជីថលដែលឆ្លើយតប និងមានដំណើរការខ្ពស់សម្រាប់ប្រតិបត្តិការភោជនីយដ្ឋាន។ បានអនុវត្តសមាសធាតុ UI អន្តរកម្ម បង្កើនប្រសិទ្ធភាពកម្មវិធីសម្រាប់ពេលវេលាផ្ទុកលឿន ធានាភាពឆបគ្នាឆ្លងឧបករណ៍ និងសហការជាមួយអ្នកពាក់ព័ន្ធដើម្បីបំពេញតម្រូវការមុខងារ និងធ្វើអោយបទពិសោធន៍អ្នកប្រើប្រាស់ទាំងមូលប្រសើរឡើង។"
      }
    ]
  },
  "projects": {
    "title": "គម្រោងថ្មីៗ",
    "viewProject": "មើលគម្រោង",
    "items": [
      {
        "name": "DevToolbox",
        "description": "បណ្តុំឧបករណ៍អ្នកអភិវឌ្ឍន៍ឥតគិតថ្លៃជាង ១០០+ សម្រាប់ការធ្វើទ្រង់ទ្រាយ ការអ៊ិនកូដ ការបំលែង និងការវិភាគទិន្នន័យ។ មុខងាររួមបញ្ចូល JSON/XML formatters, Base64 encoders, hash generators, image compression, PDF tools និងច្រើនទៀត។ ដំណើរការទាំងអស់កើតឡើងក្នុង browser - ទិន្នន័យរបស់អ្នកមិនដែលចាកចេញពីឧបករណ៍របស់អ្នកទេ។",
        "type": "គម្រោងផ្ទាល់ខ្លួន",
        "process": "បានបញ្ចប់"
      },
      {
        "name": "Algo Viz",
        "description": "វេទិកាមើលឃើញ algorithm អន្តរកម្មដែលត្រូវបានរចនាឡើងដើម្បីជួយអ្នកប្រើប្រាស់យល់ពីរចនាសម្ព័ន្ធទិន្នន័យ និង algorithms តាមរយៈចលនាជំហានម្តងៗ និងការពន្យល់ដែលមើលឃើញ។ ខ្ញុំបានអភិវឌ្ឍន៍គេហទំព័រនេះដោយប្រើ Vibe Coding និង Client-Side Rendering (CSR) ដោយអនុវត្តបច្ចេកទេស frontend ទំនើបដើម្បីបង្កើតបទពិសោធន៍រៀនសូត្ររលូន ឆ្លើយតប និងទាក់ទាញសម្រាប់អ្នកប្រើប្រាស់។",
        "type": "គម្រោងផ្ទាល់ខ្លួន",
        "process": "បានបញ្ចប់"
      }
    ]
  },
  "contact": {
    "title": "ទំនាក់ទំនង",
    "heading": "ទាក់ទងមកខ្ញុំ",
    "description": "ខ្ញុំតែងតែបើកទូលាយសម្រាប់ឱកាសថ្មី និងកិច្ចសហការ។ មិនថាអ្នកមានគម្រោងក្នុងចិត្ត ឬគ្រាន់តែចង់ជជែកទេ សូមកុំស្ទាក់ស្ទើរក្នុងការទាក់ទងមកខ្ញុំ!",
    "form": {
      "name": "ឈ្មោះ",
      "email": "អ៊ីមែល",
      "message": "សារ",
      "send": "ផ្ញើសារ",
      "sending": "កំពុងផ្ញើ...",
      "success": "សារត្រូវបានផ្ញើដោយជោគជ័យ!",
      "error": "ការផ្ញើសារបានបរាជ័យ។ សូមព្យាយាមម្តងទៀត។",
      "required": "សូមបំពេញគ្រប់វាលទាំងអស់"
    }
  },
  "footer": {
    "rights": "រក្សាសិទ្ធិគ្រប់យ៉ាង"
  }
}
